Tekla Open API Reference for Tekla Structures 2025
RebarLegFace Constructor (Contour)
 Initializes a new instance of the RebarLegFace class using the specified Contour.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarLegFace(
	Contour contour
)
Public Sub New (
	contour As Contour
)
Parameters
contour
Type: Tekla.Structures.Model.Contour
The primary contour.
See Also
Reference
RebarLegFace Class
RebarLegFace Overload
Tekla.Structures.Model Namespace